<?php 

return array(

	/*
	|--------------------------------------------------------------------------
	| User Language Lines
	|--------------------------------------------------------------------------
	|
	|
	*/

	'register'              => 'ลงทะเบียน',
	'login'                 => 'ลงชื่อเข้าใช้',
	'login_first'           => 'กรุณาลงชื่อเข้าใช้',
	'account'               => 'ชื่อผู้ใช้ระบบ',
	'forgot_password'       => 'ลืมรหัสผ่าน',
	'settings'              => 'ตั้งค่า',
	'profile'               => 'ข้อมูลผู้ใช้',
	'user_account_is_not_confirmed'          => 'ชื่อผู้ใช้นี้ไม่ได้รับการยืนยัน',
	'user_account_updated'          => 'ปรับปรุงชื่อผู้ใช้สำเร็จแล้ว',
	'user_account_created'          => 'สร้างชื่อผู้ใช้สำเร็จแล้ว',

);