<?php

class AccommodationsReportController extends ReportController {

    protected $party;

    public function __construct(Party $party)
    {
        parent::__construct();
        $this->party = $party;
    }

    //return index page
    public function getIndex()
    {
        $year = '2558-2559';
        $months = array(
            '10-2014' => 'ตุลาคม 57',
            '11-2014' => 'พฤศจิกายน 57',
            '12-2014' => 'ธันวาคม 57',
            '01-2015' => 'มกราคม 58',
            '02-2015' => 'กุมภาพันธ์ 58',
            '03-2015' => 'มีนาคม 58',
            '04-2015' => 'เมษายน 58',
            '05-2015' => 'พฤษภาคม 58',
            '06-2015' => 'มิถุนายน 58',
            '07-2015' => 'กรกฎาคม 58',
            '08-2015' => 'สิงหาคม 58',
            '09-2015' => 'กันยายน 58',
            '10-2015' => 'ตุลาคม 58',
            '11-2015' => 'พฤศจิกายน 58',
            '12-2015' => 'ธันวาคม 58',
            '01-2016' => 'มกราคม 59',
            '02-2016' => 'กุมภาพันธ์ 59',
            '03-2016' => 'มีนาคม 59',
            '04-2016' => 'เมษายน 59',
            '05-2016' => 'พฤษภาคม 59',
            '06-2016' => 'มิถุนายน 59',
            '07-2016' => 'กรกฎาคม 59',
            '08-2016' => 'สิงหาคม 59',
            '09-2016' => 'กันยายน 59'
        );

        return View::make('summaries.frequency.location_for_party', compact('year', 'months'));
    }

}